rails-first-routes-long-practice-main/first_routes_and_controllers/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Aladdin"], ["image_url", "www.genie.com"], ["artist_id", 4], ["created_at", "2023-08-03 21:08:03.472779"], ["updated_at", "2023-08-03 21:08:03.472779"]]
---
    def create
        @artwork = Artwork.new(artwork_params)
        if @artwork.save