rails-first-routes-long-practice-main/first_routes_and_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "99@yankees.com"], ["updated_at", "2023-08-03 14:32:28.173947"], ["id", 1]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)